<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="node_features" type="Parameter" version="opset1">
			<data shape="?,500" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="node_features">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="edge_index" type="Parameter" version="opset1">
			<data shape="2,?" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="edge_index">
					<dim>2</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_114_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="3" name="Constant_114" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="4" name="Constant_50_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="5" name="Constant_50" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="6" name="Transpose_1895_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 500" offset="2" size="64000" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Transpose_1895" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/convs.0/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/MatMul_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/convs.0/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/convs.0/Shape_2_output_0,/convs.0/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/convs.0/ConstantOfShape_1" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/ConstantOfShape_1_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_57_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="12" name="Constant_57" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="13" name="/convs.0/Shape_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/convs.0/Shape_3_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/convs.0/ConstantOfShape_2" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/ConstantOfShape_2_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64002" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="/convs.0/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="64010" size="16" />
			<output>
				<port id="0" precision="I64" names="/convs.0/Constant_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/convs.0/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/convs.0/Split_output_0">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="4" precision="I64" names="/convs.0/Split_output_1">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/convs.0/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64002" size="8" />
			<output>
				<port id="0" precision="I64" names="/convs.0/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/convs.0/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.0/Squeeze_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/convs.0/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64026" size="8" />
			<output>
				<port id="0" precision="I64" names="/convs.0/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/convs.0/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.0/Unsqueeze_output_0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/convs.0/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64026" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/convs.0/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_1862" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64034" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_19" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64002" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="25" name="/convs.0/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/convs.0/Gather_output_0,/convs.0/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/convs.0/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.0/Concat_output_0,/convs.0/Reshape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/convs.0/Mul" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="64042" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/convs.0/Mul_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/convs.0/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/convs.0/Equal_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/convs.0/ConstantOfShape" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="64010" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/convs.0/ConstantOfShape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/convs.0/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/convs.0/Where_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/convs.0/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.0/Expand_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/convs.0/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64002" size="8" />
			<output>
				<port id="0" precision="I64" names="/convs.0/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/convs.0/Squeeze_1" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.0/Squeeze_1_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_46" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64002" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="35" name="/convs.0/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/convs.0/Gather_1_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_62" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64002" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="37" name="/convs.0/ScatterElements" type="ScatterElementsUpdate" version="opset12">
			<data reduction="none" use_init_val="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="I64" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/convs.0/ScatterElements_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/convs.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/Add_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_1954_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64" offset="64058" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_1954" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/convs.0/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/Add_1_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_66" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64026" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/convs.0/layernorm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/layernorm/Div_output_0,/convs.0/layernorm/Mul_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_1955_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64" offset="64058" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_1955" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/convs.0/layernorm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/layernorm/Add_1_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Relu_output_0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Transpose_1909_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="7, 64" offset="64186" size="896" />
			<output>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Transpose_1909" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/convs.1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/MatMul_output_0">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/convs.1/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/convs.1/Shape_2_output_0,/convs.1/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/convs.1/ConstantOfShape_1" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/ConstantOfShape_1_output_0">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_121_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="54" name="Constant_121" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="55" name="/convs.1/Shape_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/convs.1/Shape_3_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/convs.1/ConstantOfShape_2" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/ConstantOfShape_2_output_0">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/convs.1/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64026" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/convs.1/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_1865" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64034" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_83" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64002" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="60" name="/convs.1/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/convs.1/Gather_output_0,/convs.1/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/convs.1/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.1/Concat_output_0,/convs.1/Reshape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/convs.1/Mul" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="64042" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/convs.1/Mul_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/convs.1/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/convs.1/Equal_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/convs.1/ConstantOfShape" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="64010" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/convs.1/ConstantOfShape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/convs.1/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/convs.1/Where_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/convs.1/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.1/Expand_output_0">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_110" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64002" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="68" name="/convs.1/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/convs.1/Gather_1_output_0">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_126" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64002" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="70" name="/convs.1/ScatterElements" type="ScatterElementsUpdate" version="opset12">
			<data reduction="none" use_init_val="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
				<port id="3" precision="I64" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/convs.1/ScatterElements_output_0">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/convs.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/Add_output_0">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_1956_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 7" offset="65082" size="14" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_1956" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/convs.1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/Add_1_output_0">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_130" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64026" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/convs.1/layernorm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/layernorm/Div_output_0,/convs.1/layernorm/Mul_output_0">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_1957_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 7" offset="65082" size="14" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_1957" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/convs.1/layernorm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/layernorm/Add_1_output_0">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="output" type="LogSoftmax" version="opset5">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="output">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="output/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="17" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="52" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="35" to-port="0" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1" />
		<edge from-layer="9" from-port="1" to-layer="25" to-port="0" />
		<edge from-layer="10" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="10" from-port="2" to-layer="38" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="37" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="16" from-port="0" to-layer="17" to-port="2" />
		<edge from-layer="17" from-port="3" to-layer="19" to-port="0" />
		<edge from-layer="17" from-port="4" to-layer="33" to-port="0" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="21" to-port="0" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="1" />
		<edge from-layer="21" from-port="2" to-layer="31" to-port="0" />
		<edge from-layer="21" from-port="2" to-layer="66" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="26" to-port="0" />
		<edge from-layer="23" from-port="0" to-layer="25" to-port="1" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="2" />
		<edge from-layer="25" from-port="3" to-layer="26" to-port="1" />
		<edge from-layer="26" from-port="2" to-layer="28" to-port="0" />
		<edge from-layer="26" from-port="2" to-layer="30" to-port="2" />
		<edge from-layer="27" from-port="0" to-layer="28" to-port="1" />
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0" />
		<edge from-layer="29" from-port="0" to-layer="30" to-port="1" />
		<edge from-layer="30" from-port="3" to-layer="31" to-port="1" />
		<edge from-layer="31" from-port="2" to-layer="37" to-port="1" />
		<edge from-layer="32" from-port="0" to-layer="33" to-port="1" />
		<edge from-layer="33" from-port="2" to-layer="35" to-port="1" />
		<edge from-layer="33" from-port="2" to-layer="68" to-port="1" />
		<edge from-layer="34" from-port="0" to-layer="35" to-port="2" />
		<edge from-layer="35" from-port="3" to-layer="37" to-port="2" />
		<edge from-layer="36" from-port="0" to-layer="37" to-port="3" />
		<edge from-layer="37" from-port="4" to-layer="38" to-port="1" />
		<edge from-layer="38" from-port="2" to-layer="41" to-port="0" />
		<edge from-layer="39" from-port="0" to-layer="40" to-port="0" />
		<edge from-layer="40" from-port="1" to-layer="41" to-port="1" />
		<edge from-layer="41" from-port="2" to-layer="43" to-port="0" />
		<edge from-layer="42" from-port="0" to-layer="43" to-port="1" />
		<edge from-layer="43" from-port="2" to-layer="46" to-port="0" />
		<edge from-layer="44" from-port="0" to-layer="45" to-port="0" />
		<edge from-layer="45" from-port="1" to-layer="46" to-port="1" />
		<edge from-layer="46" from-port="2" to-layer="47" to-port="0" />
		<edge from-layer="47" from-port="1" to-layer="50" to-port="0" />
		<edge from-layer="48" from-port="0" to-layer="49" to-port="0" />
		<edge from-layer="49" from-port="1" to-layer="50" to-port="1" />
		<edge from-layer="50" from-port="2" to-layer="68" to-port="0" />
		<edge from-layer="50" from-port="2" to-layer="51" to-port="0" />
		<edge from-layer="51" from-port="1" to-layer="52" to-port="1" />
		<edge from-layer="51" from-port="1" to-layer="60" to-port="0" />
		<edge from-layer="52" from-port="2" to-layer="55" to-port="0" />
		<edge from-layer="52" from-port="2" to-layer="71" to-port="0" />
		<edge from-layer="53" from-port="0" to-layer="54" to-port="0" />
		<edge from-layer="54" from-port="1" to-layer="56" to-port="0" />
		<edge from-layer="55" from-port="1" to-layer="56" to-port="1" />
		<edge from-layer="56" from-port="2" to-layer="70" to-port="0" />
		<edge from-layer="57" from-port="0" to-layer="61" to-port="0" />
		<edge from-layer="58" from-port="0" to-layer="60" to-port="1" />
		<edge from-layer="59" from-port="0" to-layer="60" to-port="2" />
		<edge from-layer="60" from-port="3" to-layer="61" to-port="1" />
		<edge from-layer="61" from-port="2" to-layer="63" to-port="0" />
		<edge from-layer="61" from-port="2" to-layer="65" to-port="2" />
		<edge from-layer="62" from-port="0" to-layer="63" to-port="1" />
		<edge from-layer="63" from-port="2" to-layer="65" to-port="0" />
		<edge from-layer="64" from-port="0" to-layer="65" to-port="1" />
		<edge from-layer="65" from-port="3" to-layer="66" to-port="1" />
		<edge from-layer="66" from-port="2" to-layer="70" to-port="1" />
		<edge from-layer="67" from-port="0" to-layer="68" to-port="2" />
		<edge from-layer="68" from-port="3" to-layer="70" to-port="2" />
		<edge from-layer="69" from-port="0" to-layer="70" to-port="3" />
		<edge from-layer="70" from-port="4" to-layer="71" to-port="1" />
		<edge from-layer="71" from-port="2" to-layer="74" to-port="0" />
		<edge from-layer="72" from-port="0" to-layer="73" to-port="0" />
		<edge from-layer="73" from-port="1" to-layer="74" to-port="1" />
		<edge from-layer="74" from-port="2" to-layer="76" to-port="0" />
		<edge from-layer="75" from-port="0" to-layer="76" to-port="1" />
		<edge from-layer="76" from-port="2" to-layer="79" to-port="0" />
		<edge from-layer="77" from-port="0" to-layer="78" to-port="0" />
		<edge from-layer="78" from-port="1" to-layer="79" to-port="1" />
		<edge from-layer="79" from-port="2" to-layer="80" to-port="0" />
		<edge from-layer="80" from-port="1" to-layer="81" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2024.3.0-16041-1e3b88e4e3f-releases/2024/3" />
		<Runtime_version value="2024.3.0-16041-1e3b88e4e3f-releases/2024/3" />
		<conversion_parameters>
			<input_model value="DIR/Flickr_GCN.onnx" />
			<is_python_api_used value="False" />
			<output_dir value="DIR" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
