<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="node_features" type="Parameter" version="opset1">
			<data shape="?,500" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="node_features">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="edge_index" type="Parameter" version="opset1">
			<data shape="2,?" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="edge_index">
					<dim>2</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_191_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="3" name="Constant_191" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="4" name="ShapeOf_2178" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/convs.0/aggr_module/Concat_2_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_2179" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_2180" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="7" name="Gather_2181" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/convs.0/Slice_output_0,/convs.0/aggr_module/Concat_output_0,/convs.0/aggr_module/Shape_2_output_0,/convs.0/aggr_module/Unsqueeze_2_output_0,/convs.0/aggr_module/Unsqueeze_output_0,/convs.1/Slice_output_0,/convs.1/aggr_module/Concat_output_0,/convs.1/aggr_module/Shape_2_output_0,/convs.1/aggr_module/Unsqueeze_2_output_0,/convs.1/aggr_module/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_87_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="9" name="Constant_87" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="10" name="/convs.0/aggr_module/ConstantOfShape_3" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/aggr_module/ConstantOfShape_3_output_0">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_96_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="12" name="Constant_96" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="13" name="/convs.0/aggr_module/Shape_4" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/convs.0/aggr_module/Shape_4_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/convs.0/aggr_module/ConstantOfShape_4" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/aggr_module/ConstantOfShape_4_output_0">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/convs.0/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="10" size="8" />
			<output>
				<port id="0" precision="I64" names="/convs.0/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="16" name="Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="17" name="/convs.0/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/convs.0/Gather_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/convs.0/aggr_module/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/convs.0/aggr_module/Constant_3_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/convs.0/aggr_module/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.0/aggr_module/Reshape_output_0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="ShapeOf_2309" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_2310" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_2308" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="23" name="/convs.0/aggr_module/Gather_1" type="Gather" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/convs.0/aggr_module/Concat_1_output_0,/convs.0/aggr_module/Gather_1_output_0,/convs.0/aggr_module/Unsqueeze_1_output_0,/convs.1/aggr_module/Concat_1_output_0,/convs.1/aggr_module/Gather_1_output_0,/convs.1/aggr_module/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_2186" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_2187" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="26" name="Gather_2188" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/convs.0/aggr_module/Gather_output_0,/convs.0/aggr_module/Unsqueeze_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/convs.0/aggr_module/Shape" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.0/aggr_module/Shape_1_output_0,/convs.0/aggr_module/Shape_3_output_0,/convs.0/aggr_module/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/convs.0/aggr_module/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.0/aggr_module/Expand_output_0">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/convs.0/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2" size="8" />
			<output>
				<port id="0" precision="I64" names="/convs.0/Constant_output_0" />
			</output>
		</layer>
		<layer id="30" name="Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="31" name="/convs.0/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/convs.0/Gather_1_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="34" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="33" name="/convs.0/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/convs.0/Gather_2_output_0">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_101" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="35" name="/convs.0/aggr_module/ScatterElements_1" type="ScatterElementsUpdate" version="opset12">
			<data reduction="none" use_init_val="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
				<port id="3" precision="I64" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/convs.0/aggr_module/ScatterElements_1_output_0">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/convs.0/aggr_module/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/aggr_module/Add_1_output_0">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_53_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="38" name="Constant_53" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="39" name="/convs.0/aggr_module/ConstantOfShape_1" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/aggr_module/ConstantOfShape_1_output_0,/convs.0/aggr_module/ConstantOfShape_2_output_0,/convs.1/aggr_module/ConstantOfShape_1_output_0,/convs.1/aggr_module/ConstantOfShape_2_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_47_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="42" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="41" name="Constant_47" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="42" name="/convs.0/aggr_module/ConstantOfShape" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/aggr_module/ConstantOfShape_output_0,/convs.1/aggr_module/ConstantOfShape_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_66" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="44" name="/convs.0/aggr_module/ScatterElements" type="ScatterElementsUpdate" version="opset12">
			<data reduction="none" use_init_val="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I64" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/convs.0/aggr_module/ScatterElements_output_0,/convs.1/aggr_module/ScatterElements_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/convs.0/aggr_module/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/aggr_module/Add_output_0,/convs.1/aggr_module/Add_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/convs.0/aggr_module/Clip" type="Clamp" version="opset1">
			<data min="1" max="3.4028234663852886e+38" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/convs.0/aggr_module/Clip_output_0,/convs.1/aggr_module/Clip_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/convs.0/aggr_module/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/convs.0/aggr_module/Constant_4_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/convs.0/aggr_module/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/aggr_module/Expand_1_output_0,/convs.0/aggr_module/Reshape_1_output_0,/convs.1/aggr_module/Expand_1_output_0,/convs.1/aggr_module/Reshape_output_0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/convs.0/aggr_module/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/aggr_module/Div_output_0">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="convs.0.lin_l.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 500" offset="44" size="256000" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="convs.0.lin_l.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="convs.0.lin_l.weight">
					<dim>256</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/convs.0/lin_l/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_2125_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256" offset="256044" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_2125" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/convs.0/lin_l/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/lin_l/Gemm_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Transpose_2068_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 500" offset="44" size="256000" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Transpose_2068" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/convs.0/lin_r/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/lin_r/MatMul_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/convs.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/Add_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Relu_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/convs.1/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/convs.1/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_1992" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_1989" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="64" name="/convs.1/aggr_module/Gather" type="Gather" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/convs.1/aggr_module/Gather_output_0,/convs.1/aggr_module/Unsqueeze_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/convs.1/aggr_module/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.1/aggr_module/Concat_2_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/convs.1/aggr_module/ConstantOfShape_3" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/aggr_module/ConstantOfShape_3_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_200_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="68" name="Constant_200" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="69" name="/convs.1/aggr_module/Shape_4" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/convs.1/aggr_module/Shape_4_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/convs.1/aggr_module/ConstantOfShape_4" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/aggr_module/ConstantOfShape_4_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/convs.1/aggr_module/Shape" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.1/aggr_module/Shape_1_output_0,/convs.1/aggr_module/Shape_3_output_0,/convs.1/aggr_module/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/convs.1/aggr_module/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.1/aggr_module/Expand_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_121" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="34" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="74" name="/convs.1/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/convs.1/Gather_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_205" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="76" name="/convs.1/aggr_module/ScatterElements_1" type="ScatterElementsUpdate" version="opset12">
			<data reduction="none" use_init_val="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="I64" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/convs.1/aggr_module/ScatterElements_1_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/convs.1/aggr_module/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/aggr_module/Add_1_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/convs.1/aggr_module/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/aggr_module/Div_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="convs.1.lin_l.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="7, 256" offset="256556" size="3584" />
			<output>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="convs.1.lin_l.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="convs.1.lin_l.weight">
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/convs.1/lin_l/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_2126_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 7" offset="260140" size="14" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_2126" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/convs.1/lin_l/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/lin_l/Gemm_output_0">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Transpose_2080_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="7, 256" offset="256556" size="3584" />
			<output>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Transpose_2080" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/convs.1/lin_r/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/lin_r/MatMul_output_0">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="output" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="output">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="output/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="31" to-port="0" />
		<edge from-layer="0" from-port="0" to-layer="20" to-port="0" />
		<edge from-layer="0" from-port="0" to-layer="17" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="33" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="58" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="66" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="10" to-port="1" />
		<edge from-layer="4" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="26" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="7" to-port="1" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="2" />
		<edge from-layer="7" from-port="3" to-layer="65" to-port="0" />
		<edge from-layer="7" from-port="3" to-layer="39" to-port="1" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="10" from-port="2" to-layer="36" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="35" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="16" from-port="0" to-layer="17" to-port="2" />
		<edge from-layer="17" from-port="3" to-layer="19" to-port="0" />
		<edge from-layer="17" from-port="3" to-layer="44" to-port="1" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="72" to-port="0" />
		<edge from-layer="19" from-port="2" to-layer="28" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="21" from-port="0" to-layer="23" to-port="1" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="2" />
		<edge from-layer="23" from-port="3" to-layer="71" to-port="0" />
		<edge from-layer="23" from-port="3" to-layer="27" to-port="0" />
		<edge from-layer="23" from-port="3" to-layer="42" to-port="1" />
		<edge from-layer="24" from-port="0" to-layer="26" to-port="1" />
		<edge from-layer="25" from-port="0" to-layer="26" to-port="2" />
		<edge from-layer="26" from-port="3" to-layer="27" to-port="1" />
		<edge from-layer="27" from-port="2" to-layer="28" to-port="1" />
		<edge from-layer="28" from-port="2" to-layer="35" to-port="1" />
		<edge from-layer="29" from-port="0" to-layer="31" to-port="1" />
		<edge from-layer="30" from-port="0" to-layer="31" to-port="2" />
		<edge from-layer="31" from-port="3" to-layer="33" to-port="1" />
		<edge from-layer="31" from-port="3" to-layer="74" to-port="1" />
		<edge from-layer="32" from-port="0" to-layer="33" to-port="2" />
		<edge from-layer="33" from-port="3" to-layer="35" to-port="2" />
		<edge from-layer="34" from-port="0" to-layer="35" to-port="3" />
		<edge from-layer="35" from-port="4" to-layer="36" to-port="1" />
		<edge from-layer="36" from-port="2" to-layer="49" to-port="0" />
		<edge from-layer="37" from-port="0" to-layer="38" to-port="0" />
		<edge from-layer="38" from-port="1" to-layer="39" to-port="0" />
		<edge from-layer="39" from-port="2" to-layer="44" to-port="0" />
		<edge from-layer="39" from-port="2" to-layer="45" to-port="0" />
		<edge from-layer="40" from-port="0" to-layer="41" to-port="0" />
		<edge from-layer="41" from-port="1" to-layer="42" to-port="0" />
		<edge from-layer="42" from-port="2" to-layer="44" to-port="2" />
		<edge from-layer="43" from-port="0" to-layer="44" to-port="3" />
		<edge from-layer="44" from-port="4" to-layer="45" to-port="1" />
		<edge from-layer="45" from-port="2" to-layer="46" to-port="0" />
		<edge from-layer="46" from-port="1" to-layer="48" to-port="0" />
		<edge from-layer="47" from-port="0" to-layer="48" to-port="1" />
		<edge from-layer="48" from-port="2" to-layer="78" to-port="1" />
		<edge from-layer="48" from-port="2" to-layer="49" to-port="1" />
		<edge from-layer="49" from-port="2" to-layer="52" to-port="0" />
		<edge from-layer="50" from-port="0" to-layer="51" to-port="0" />
		<edge from-layer="51" from-port="1" to-layer="52" to-port="1" />
		<edge from-layer="52" from-port="2" to-layer="55" to-port="0" />
		<edge from-layer="53" from-port="0" to-layer="54" to-port="0" />
		<edge from-layer="54" from-port="1" to-layer="55" to-port="1" />
		<edge from-layer="55" from-port="2" to-layer="59" to-port="0" />
		<edge from-layer="56" from-port="0" to-layer="57" to-port="0" />
		<edge from-layer="57" from-port="1" to-layer="58" to-port="1" />
		<edge from-layer="58" from-port="2" to-layer="59" to-port="1" />
		<edge from-layer="59" from-port="2" to-layer="60" to-port="0" />
		<edge from-layer="60" from-port="1" to-layer="74" to-port="0" />
		<edge from-layer="60" from-port="1" to-layer="87" to-port="0" />
		<edge from-layer="60" from-port="1" to-layer="61" to-port="0" />
		<edge from-layer="61" from-port="1" to-layer="64" to-port="0" />
		<edge from-layer="62" from-port="0" to-layer="64" to-port="1" />
		<edge from-layer="63" from-port="0" to-layer="64" to-port="2" />
		<edge from-layer="64" from-port="3" to-layer="71" to-port="1" />
		<edge from-layer="64" from-port="3" to-layer="65" to-port="1" />
		<edge from-layer="65" from-port="2" to-layer="66" to-port="1" />
		<edge from-layer="66" from-port="2" to-layer="69" to-port="0" />
		<edge from-layer="66" from-port="2" to-layer="77" to-port="0" />
		<edge from-layer="67" from-port="0" to-layer="68" to-port="0" />
		<edge from-layer="68" from-port="1" to-layer="70" to-port="0" />
		<edge from-layer="69" from-port="1" to-layer="70" to-port="1" />
		<edge from-layer="70" from-port="2" to-layer="76" to-port="0" />
		<edge from-layer="71" from-port="2" to-layer="72" to-port="1" />
		<edge from-layer="72" from-port="2" to-layer="76" to-port="1" />
		<edge from-layer="73" from-port="0" to-layer="74" to-port="2" />
		<edge from-layer="74" from-port="3" to-layer="76" to-port="2" />
		<edge from-layer="75" from-port="0" to-layer="76" to-port="3" />
		<edge from-layer="76" from-port="4" to-layer="77" to-port="1" />
		<edge from-layer="77" from-port="2" to-layer="78" to-port="0" />
		<edge from-layer="78" from-port="2" to-layer="81" to-port="0" />
		<edge from-layer="79" from-port="0" to-layer="80" to-port="0" />
		<edge from-layer="80" from-port="1" to-layer="81" to-port="1" />
		<edge from-layer="81" from-port="2" to-layer="84" to-port="0" />
		<edge from-layer="82" from-port="0" to-layer="83" to-port="0" />
		<edge from-layer="83" from-port="1" to-layer="84" to-port="1" />
		<edge from-layer="84" from-port="2" to-layer="88" to-port="0" />
		<edge from-layer="85" from-port="0" to-layer="86" to-port="0" />
		<edge from-layer="86" from-port="1" to-layer="87" to-port="1" />
		<edge from-layer="87" from-port="2" to-layer="88" to-port="1" />
		<edge from-layer="88" from-port="2" to-layer="89" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2024.3.0-16041-1e3b88e4e3f-releases/2024/3" />
		<Runtime_version value="2024.3.0-16041-1e3b88e4e3f-releases/2024/3" />
		<conversion_parameters>
			<input_model value="DIR/staticFlickr_SAGE_batch13.onnx" />
			<is_python_api_used value="False" />
			<output_dir value="DIR" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
