<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="onnx::MatMul_0" type="Parameter" version="opset1">
			<data shape="89250,500" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_0">
					<dim>89250</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="edge_index" type="Parameter" version="opset1">
			<data shape="2,899756" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="edge_index">
					<dim>2</dim>
					<dim>899756</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/convs.1/Constant_3_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="89250, 7" offset="0" size="1249500" />
			<output>
				<port id="0" precision="FP16">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/convs.1/Constant_3" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/convs.1/Constant_3_output_0">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1249500" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="5" name="/convs.0/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1249508" size="16" />
			<output>
				<port id="0" precision="I64" names="/convs.0/Constant_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/convs.0/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>899756</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/convs.0/Split_output_0">
					<dim>1</dim>
					<dim>899756</dim>
				</port>
				<port id="4" precision="I64" names="/convs.0/Split_output_1">
					<dim>1</dim>
					<dim>899756</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_1568" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1249524" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/convs.0/Unsqueeze" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>899756</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.0/Unsqueeze_output_0">
					<dim>899756</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/convs.1/Where" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1249540" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/convs.1/Where_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/convs.1/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>899756</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.1/Expand_output_0">
					<dim>899756</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/convs.0/Constant_7_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="89250, 64" offset="1249556" size="11424000" />
			<output>
				<port id="0" precision="FP16">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/convs.0/Constant_7" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/convs.0/Constant_7_output_0">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/convs.0/Where" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="12673556" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/convs.0/Where_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/convs.0/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>899756</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.0/Expand_output_0">
					<dim>899756</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Transpose_1529_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 500" offset="12673572" size="64000" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Transpose_1529" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/convs.0/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/MatMul_output_0">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_1570" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12737572" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/convs.0/Squeeze_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>899756</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/convs.0/Squeeze_1_output_0">
					<dim>899756</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_32" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1249500" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="21" name="/convs.0/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>899756</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/convs.0/Gather_output_0">
					<dim>899756</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_35" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1249500" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="23" name="/convs.0/ScatterElements" type="ScatterElementsUpdate" version="opset12">
			<data reduction="none" use_init_val="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>899756</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>899756</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="I64" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/convs.0/Add_output_0,/convs.0/ScatterElements_output_0">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_1562_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64" offset="12737580" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_1562" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/convs.0/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/Add_1_output_0">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_40" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12737572" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/convs.0/layernorm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/layernorm/Div_output_0,/convs.0/layernorm/Mul_output_0">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_1563_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64" offset="12737580" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_1563" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/convs.0/layernorm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.0/layernorm/Add_1_output_0">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Relu_output_0">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Transpose_1541_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="7, 64" offset="12737708" size="896" />
			<output>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Transpose_1541" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/convs.1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/MatMul_output_0">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_70" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1249500" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="37" name="/convs.1/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I64">
					<dim>899756</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/convs.1/Gather_output_0">
					<dim>899756</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_73" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1249500" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="39" name="/convs.1/ScatterElements" type="ScatterElementsUpdate" version="opset12">
			<data reduction="none" use_init_val="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I64">
					<dim>899756</dim>
					<dim>7</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>899756</dim>
					<dim>7</dim>
				</port>
				<port id="3" precision="I64" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/convs.1/Add_output_0,/convs.1/ScatterElements_output_0">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_1564_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 7" offset="12738604" size="14" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_1564" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/convs.1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/Add_1_output_0">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_78" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12737572" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/convs.1/layernorm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/layernorm/Div_output_0,/convs.1/layernorm/Mul_output_0">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_1565_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 7" offset="12738604" size="14" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_1565" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/convs.1/layernorm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/convs.1/layernorm/Add_1_output_0">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="87" type="LogSoftmax" version="opset5">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="87">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="87/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>89250</dim>
					<dim>7</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="6" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="17" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="39" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="2" />
		<edge from-layer="6" from-port="3" to-layer="8" to-port="0" />
		<edge from-layer="6" from-port="4" to-layer="19" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="8" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="9" from-port="0" to-layer="10" to-port="1" />
		<edge from-layer="10" from-port="2" to-layer="39" to-port="1" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="23" to-port="1" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="21" to-port="0" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="21" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="37" to-port="1" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="2" />
		<edge from-layer="21" from-port="3" to-layer="23" to-port="2" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="3" />
		<edge from-layer="23" from-port="4" to-layer="26" to-port="0" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="1" />
		<edge from-layer="26" from-port="2" to-layer="28" to-port="0" />
		<edge from-layer="27" from-port="0" to-layer="28" to-port="1" />
		<edge from-layer="28" from-port="2" to-layer="31" to-port="0" />
		<edge from-layer="29" from-port="0" to-layer="30" to-port="0" />
		<edge from-layer="30" from-port="1" to-layer="31" to-port="1" />
		<edge from-layer="31" from-port="2" to-layer="32" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="35" to-port="0" />
		<edge from-layer="33" from-port="0" to-layer="34" to-port="0" />
		<edge from-layer="34" from-port="1" to-layer="35" to-port="1" />
		<edge from-layer="35" from-port="2" to-layer="37" to-port="0" />
		<edge from-layer="36" from-port="0" to-layer="37" to-port="2" />
		<edge from-layer="37" from-port="3" to-layer="39" to-port="2" />
		<edge from-layer="38" from-port="0" to-layer="39" to-port="3" />
		<edge from-layer="39" from-port="4" to-layer="42" to-port="0" />
		<edge from-layer="40" from-port="0" to-layer="41" to-port="0" />
		<edge from-layer="41" from-port="1" to-layer="42" to-port="1" />
		<edge from-layer="42" from-port="2" to-layer="44" to-port="0" />
		<edge from-layer="43" from-port="0" to-layer="44" to-port="1" />
		<edge from-layer="44" from-port="2" to-layer="47" to-port="0" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="0" />
		<edge from-layer="46" from-port="1" to-layer="47" to-port="1" />
		<edge from-layer="47" from-port="2" to-layer="48" to-port="0" />
		<edge from-layer="48" from-port="1" to-layer="49" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2024.2.0-15519-5c0f38f83f6-releases/2024/2" />
		<Runtime_version value="2024.2.0-15519-5c0f38f83f6-releases/2024/2" />
		<conversion_parameters>
			<input_model value="DIR/test_opt14.onnx" />
			<is_python_api_used value="False" />
			<output_dir value="/home/haoyangf/Private/GNNBenchmark/Ir" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
